Show / Hide Table of Contents
Class CombiInputEC
Combination according to EC in the model
Inheritance
System.Object
OpenObject
OpenElementId
CombiInput
CombiInputEC
Inherited Members
 CombiInput.Name
 CombiInput.Items
 CombiInput.Description
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Loading
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Loading.CombiInputEC,CI.Loading", "CI.StructModel.Loading.ICombiInput,CI.BasicTypes", typeof(CombiInput))]
public class CombiInputEC : CombiInput
Constructors
Improve this Doc   View Source
CombiInputEC()
Constructor
Declaration
public CombiInputEC()
Properties
Improve this Doc   View Source
TypeCalculationCombi
Type of combination
Declaration
[OpenModelProperty("TypeLinear_Envelope")]
public TypeCalculationCombiEC TypeCalculationCombi { get; set; }
Property Value
 Type |  Description
 TypeCalculationCombiEC
Improve this Doc   View Source
TypeCombiEC
Type of EC combination
Declaration
public TypeOfCombiEC TypeCombiEC { get; set; }
Property Value
 Type |  Description
 TypeOfCombiEC
 Improve this Doc
 View Source